<?xml version="1.0"?>
<GCC_XML cvs_revision="1.135">
  <Namespace id="_1" name="::" members="_3 _4 _5 _6 _7 _8 _9 _11 _12 _13 _14 _16 _17 _18 _20 _21 _22 _23 _25 _26 _27 _28 _29 _31 _32 _33 _34 _36 _38 _40 _42 _43 _44 _45 _47 _48 _49 _50 _51 _52 _53 _54 _55 _56 _57 _58 _59 _60 _61 _62 _63 _64 _65 _66 _67 _68 _69 _71 _72 _73 _77 _78 _79 _81 _82 _76 _83 _84 _85 _86 _88 _89 _90 _91 _92 _93 _94 _95 _96 _97 _98 _99 _100 _101 _102 _104 _105 _106 _107 _108 _109 _110 _111 _112 _113 _114 _115 _116 _117 _118 _119 _120 _121 _122 _124 _125 _126 _127 _128 _129 _131 _132 _133 _134 _135 _136 _137 _138 _139 _140 _142 _143 _144 _145 _146 _147 _148 _149 _150 _151 _152 _153 _154 _155 _156 _157 _158 _2 _160 _161 _24 _87 _75 _70 _37 _74 _10 _162 _163 _164 _165 _166 _167 _168 _169 _170 _171 _172 _173 _174 _175 _176 _177 _178 _179 _180 _181 _182 _183 _184 _185 _186 _187 _188 _189 _190 _191 _192 _193 _194 _195 _197 _198 _199 _200 _201 _202 _204 _205 _206 _207 _208 _209 _210 _211 _212 _213 _214 _215 _217 _218 _219 _220 _221 _222 _223 _159 _224 _225 _226 _227 _228 _229 _230 _130 _123 _232 _233 _234 _235 _236 _237 _238 _239 _240 _241 _242 _243 _244 _245 _246 _247 _248 _249 _250 _251 _252 _253 _254 _255 _256 _257 _259 " mangled="_Z2::" demangled="::"/>
  <Namespace id="_2" name="std" context="_1" members="" mangled="_Z3std" demangled="std"/>
  <Function id="_3" name="__builtin_nans" returns="_260" context="_1" location="f0:21" file="f0" line="21" extern="1" attributes="nothrow const nonnull">

  </Function>
  <PointerType id="_231" type="_182" size="64" align="64"/>
  <Typedef id="_232" name="__timezone_ptr_t" type="_231r" context="_1" location="f6:63" file="f6" line="63"/>
  <Function id="_233" name="__builtin_ceilf" returns="_262" context="_1" mangled="ceilf" location="f0:37" file="f0" line="37" extern="1" attributes="nothrow const">
    <Argument type="_262" location="f0:37" file="f0" line="37"/>
  </Function>
  <Function id="_234" name="__builtin_ceill" returns="_263" context="_1" mangled="ceill" location="f0:38" file="f0" line="38" extern="1" attributes="nothrow const">
    <Argument type="_263" location="f0:38" file="f0" line="38"/>
  </Function>
  <Typedef id="_235" name="__u_quad_t" type="_39" context="_1" location="f3:54" file="f3" line="54"/>
  <Function id="_236" name="__builtin_csinf" returns="_271" context="_1" mangled="csinf" location="f0:114" file="f0" line="114" extern="1" attributes="nothrow pure no vops">
    <Argument type="_271" location="f0:114" file="f0" line="114"/>
  </Function>
  <Function id="_237" name="__builtin_csinh" returns="_278" context="_1" mangled="csinh" location="f0:118" file="f0" line="118" extern="1" attributes="nothrow pure no vops">
    <Argument type="_278" location="f0:118" file="f0" line="118"/>
  </Function>
  <Function id="_238" name="__builtin_csinl" returns="_272" context="_1" mangled="csinl" location="f0:116" file="f0" line="116" extern="1" attributes="nothrow pure no vops">
    <Argument type="_272" location="f0:116" file="f0" line="116"/>
  </Function>
  <Function id="_239" name="__builtin_acos" returns="_260" context="_1" mangled="acos" location="f0:24" file="f0" line="24" extern="1" attributes="nothrow">
    <Argument type="_260" location="f0:24" file="f0" line="24"/>
  </Function>
  <Typedef id="_240" name="__rlim_t" type="_39" context="_1" location="f3:146" file="f3" line="146"/>
  <Function id="_241" name="__builtin_ctzll" returns="_35" context="_1" location="f0:98" file="f0" line="98" extern="1" attributes="nothrow const">
    <Argument type="_46" location="f0:98" file="f0" line="98"/>
  </Function>
  <Function id="_242" name="__builtin_cargf" returns="_262" context="_1" mangled="cargf" location="f0:93" file="f0" line="93" extern="1" attributes="nothrow pure no vops">
    <Argument type="_271" location="f0:93" file="f0" line="93"/>
  </Function>
  <Function id="_243" name="__builtin_cargl" returns="_263" context="_1" mangled="cargl" location="f0:95" file="f0" line="95" extern="1" attributes="nothrow pure no vops">
    <Argument type="_272" location="f0:95" file="f0" line="95"/>
  </Function>
  <Typedef id="_244" name="__nlink_t" type="_39" context="_1" location="f3:140" file="f3" line="140"/>
  <Function id="_245" name="__builtin_cosf" returns="_262" context="_1" mangled="cosf" location="f0:40" file="f0" line="40" extern="1" attributes="nothrow pure no vops">
    <Argument type="_262" location="f0:40" file="f0" line="40"/>
  </Function>
  <Function id="_246" name="__builtin_cosh" returns="_260" context="_1" mangled="cosh" location="f0:41" file="f0" line="41" extern="1" attributes="nothrow">
    <Argument type="_260" location="f0:41" file="f0" line="41"/>
  </Function>
  <Function id="_247" name="__builtin_cosl" returns="_263" context="_1" mangled="cosl" location="f0:44" file="f0" line="44" extern="1" attributes="nothrow pure no vops">
    <Argument type="_263" location="f0:44" file="f0" line="44"/>
  </Function>
  <Function id="_248" name="select" returns="_35" context="_1" location="f5:112" file="f5" line="112" extern="1">
    <Argument name="__nfds" type="_35" location="f5:112" file="f5" line="112"/>
    <Argument name="__readfds" type="_336r" location="f5:112" file="f5" line="112"/>
    <Argument name="__writefds" type="_336r" location="f5:112" file="f5" line="112"/>
    <Argument name="__exceptfds" type="_336r" location="f5:112" file="f5" line="112"/>
    <Argument name="__timeout" type="_314r" location="f5:112" file="f5" line="112"/>
  </Function>
  <Function id="_249" name="__builtin_isgreater" returns="_270" context="_1" location="f0:137" file="f0" line="137" extern="1" attributes="nothrow const">
    <Ellipsis/>
  </Function>
  <Typedef id="_250" name="__blksize_t" type="_19" context="_1" location="f3:164" file="f3" line="164"/>
  <Typedef id="_251" name="__ino64_t" type="_39" context="_1" location="f3:138" file="f3" line="138"/>
  <Function id="_252" name="__builtin_sinf" returns="_262" context="_1" mangled="sinf" location="f0:76" file="f0" line="76" extern="1" attributes="nothrow pure no vops">
    <Argument type="_262" location="f0:76" file="f0" line="76"/>
  </Function>
  <Function id="_253" name="__builtin_sinh" returns="_260" context="_1" mangled="sinh" location="f0:77" file="f0" line="77" extern="1" attributes="nothrow">
    <Argument type="_260" location="f0:77" file="f0" line="77"/>
  </Function>
  <Function id="_254" name="__builtin_sinl" returns="_263" context="_1" mangled="sinl" location="f0:80" file="f0" line="80" extern="1" attributes="nothrow pure no vops">
    <Argument type="_263" location="f0:80" file="f0" line="80"/>
  </Function>
  <Function id="_255" name="__builtin_csin" returns="_278" context="_1" mangled="csin" location="f0:115" file="f0" line="115" extern="1" attributes="nothrow pure no vops">
    <Argument type="_278" location="f0:115" file="f0" line="115"/>
  </Function>
  <Typedef id="_256" name="__clock_t" type="_19" context="_1" location="f3:145" file="f3" line="145"/>
  <Typedef id="_257" name="__int32_t" type="_35" context="_1" location="f3:41" file="f3" line="41"/>
  <PointerType id="_258" type="_361" size="64" align="64"/>
  <Typedef id="_259" name="__caddr_t" type="_258" context="_1" location="f3:186" file="f3" line="186"/>
  <FundamentalType id="_260" name="double" size="64" align="64"/>
  <PointerType id="_261" type="_361c" size="64" align="64"/>
  <FundamentalType id="_262" name="float" size="32" align="32"/>
  <FundamentalType id="_263" name="long double" size="128" align="128"/>
  <Field id="_264" name="tv_sec" type="_160" offset="0" context="_6" access="public" location="f1:77" file="f1" line="77"/>
  <Field id="_265" name="tv_usec" type="_55" offset="64" context="_6" access="public" location="f1:78" file="f1" line="78"/>
  <Destructor id="_266" name="timeval" artificial="1" throw="" context="_6" access="public" mangled="_ZN7timevalD1Ev *INTERNAL* " demangled="timeval::~timeval()" location="f1:76" file="f1" line="76" endline="76" inline="1">
  </Destructor>
  <OperatorMethod id="_267" name="=" returns="_363" artificial="1" throw="" context="_6" access="public" mangled="_ZN7timevalaSERKS_" demangled="timeval::operator=(timeval const&amp;)" location="f1:76" file="f1" line="76" endline="76" inline="1">
    <Argument type="_364" location="f1:76" file="f1" line="76"/>
  </OperatorMethod>
  <Constructor id="_268" name="timeval" artificial="1" throw="" context="_6" access="public" mangled="_ZN7timevalC1ERKS_ *INTERNAL* " demangled="timeval::timeval(timeval const&amp;)" location="f1:76" file="f1" line="76" endline="76" inline="1">
    <Argument type="_364" location="f1:76" file="f1" line="76"/>
  </Constructor>
  <Constructor id="_269" name="timeval" artificial="1" throw="" context="_6" access="public" mangled="_ZN7timevalC1Ev *INTERNAL* " demangled="timeval::timeval()" location="f1:76" file="f1" line="76" inline="1"/>
  <FundamentalType id="_270" name="bool" size="8" align="8"/>
  <FundamentalType id="_271" name="complex float" size="64" align="32"/>
  <FundamentalType id="_272" name="complex long double" size="256" align="128"/>
  <Field id="_273" name="__val" type="_365" offset="0" context="_24" access="public" location="f4:31" file="f4" line="31"/>
  <Destructor id="_274" name="._1" artificial="1" throw="" context="_24" access="public" mangled="_ZN10__sigset_tD1Ev *INTERNAL* " demangled="__sigset_t::~__sigset_t()" location="f4:32" file="f4" line="32" endline="32" inline="1">
  </Destructor>
  <OperatorMethod id="_275" name="=" returns="_366" artificial="1" throw="" context="_24" access="public" mangled="_ZN10__sigset_taSERKS_" demangled="__sigset_t::operator=(__sigset_t const&amp;)" location="f4:32" file="f4" line="32" endline="32" inline="1">
    <Argument type="_367" location="f4:30" file="f4" line="30"/>
  </OperatorMethod>
  <Constructor id="_276" name="._1" artificial="1" throw="" context="_24" access="public" mangled="_ZN10__sigset_tC1ERKS_ *INTERNAL* " demangled="__sigset_t::__sigset_t(__sigset_t const&amp;)" location="f4:32" file="f4" line="32" endline="32" inline="1">
    <Argument type="_367" location="f4:30" file="f4" line="30"/>
  </Constructor>
  <Constructor id="_277" name="._1" artificial="1" throw="" context="_24" access="public" mangled="_ZN10__sigset_tC1Ev *INTERNAL* " demangled="__sigset_t::__sigset_t()" location="f4:32" file="f4" line="32" inline="1"/>
  <FundamentalType id="_278" name="complex double" size="128" align="64"/>
  <PointerType id="_279" type="_187" size="64" align="64"/>
  <Field id="_280" name="da0" type="_133" offset="0" context="_76" access="public" location="f2:125" file="f2" line="125"/>
  <Field id="_281" name="da1" type="_133" offset="16" context="_76" access="public" location="f2:125" file="f2" line="125"/>
  <Field id="_282" name="da2" type="_133" offset="32" context="_76" access="public" location="f2:125" file="f2" line="125"/>
  <Field id="_283" name="sa0" type="_133" offset="48" context="_76" access="public" location="f2:127" file="f2" line="127"/>
  <Field id="_284" name="sa1" type="_133" offset="64" context="_76" access="public" location="f2:127" file="f2" line="127"/>
  <Field id="_285" name="sa2" type="_133" offset="80" context="_76" access="public" location="f2:127" file="f2" line="127"/>
  <Field id="_286" name="etype" type="_133" offset="96" context="_76" access="public" location="f2:129" file="f2" line="129"/>
  <Destructor id="_287" name="._3" artificial="1" throw="" context="_76" access="public" mangled="_ZN15ec_etherheadertD1Ev *INTERNAL* " demangled="ec_etherheadert::~ec_etherheadert()" location="f2:130" file="f2" line="130" endline="130" inline="1">
  </Destructor>
  <OperatorMethod id="_288" name="=" returns="_368" artificial="1" throw="" context="_76" access="public" mangled="_ZN15ec_etherheadertaSERKS_" demangled="ec_etherheadert::operator=(ec_etherheadert const&amp;)" location="f2:130" file="f2" line="130" endline="130" inline="1">
    <Argument type="_369" location="f2:123" file="f2" line="123"/>
  </OperatorMethod>
  <Constructor id="_289" name="._3" artificial="1" throw="" context="_76" access="public" mangled="_ZN15ec_etherheadertC1ERKS_ *INTERNAL* " demangled="ec_etherheadert::ec_etherheadert(ec_etherheadert const&amp;)" location="f2:130" file="f2" line="130" endline="130" inline="1">
    <Argument type="_369" location="f2:123" file="f2" line="123"/>
  </Constructor>
  <Constructor id="_290" name="._3" artificial="1" throw="" context="_76" access="public" mangled="_ZN15ec_etherheadertC1Ev *INTERNAL* " demangled="ec_etherheadert::ec_etherheadert()" location="f2:130" file="f2" line="130" inline="1"/>
  <PointerType id="_291" type="_187c" size="64" align="64"/>
  <CvQualifiedType id="_291r" type="_291" restrict="1"/>
  <CvQualifiedType id="_279r" type="_279" restrict="1"/>
  <PointerType id="_294" type="_6c" size="64" align="64"/>
  <FundamentalType id="_295" name="void" align="8"/>
  <Field id="_296" name="fds_bits" type="_372" offset="0" context="_82" access="public" location="f5:72" file="f5" line="72"/>
  <Destructor id="_297" name="._2" artificial="1" throw="" context="_82" access="public" mangled="_ZN6fd_setD1Ev *INTERNAL* " demangled="fd_set::~fd_set()" location="f5:78" file="f5" line="78" endline="78" inline="1">
  </Destructor>
  <OperatorMethod id="_298" name="=" returns="_373" artificial="1" throw="" context="_82" access="public" mangled="_ZN6fd_setaSERKS_" demangled="fd_set::operator=(fd_set const&amp;)" location="f5:78" file="f5" line="78" endline="78" inline="1">
    <Argument type="_374" location="f5:68" file="f5" line="68"/>
  </OperatorMethod>
  <Constructor id="_299" name="._2" artificial="1" throw="" context="_82" access="public" mangled="_ZN6fd_setC1ERKS_ *INTERNAL* " demangled="fd_set::fd_set(fd_set const&amp;)" location="f5:78" file="f5" line="78" endline="78" inline="1">
    <Argument type="_374" location="f5:68" file="f5" line="68"/>
  </Constructor>
  <Constructor id="_300" name="._2" artificial="1" throw="" context="_82" access="public" mangled="_ZN6fd_setC1Ev *INTERNAL* " demangled="fd_set::fd_set()" location="f5:78" file="f5" line="78" inline="1"/>
  <Field id="_301" name="elength" type="_133" offset="0" context="_87" access="public" location="f2:139" file="f2" line="139"/>
  <Field id="_302" name="command" type="_16" offset="16" context="_87" access="public" location="f2:141" file="f2" line="141"/>
  <Field id="_303" name="index" type="_16" offset="24" context="_87" access="public" location="f2:143" file="f2" line="143"/>
  <Field id="_304" name="ADP" type="_133" offset="32" context="_87" access="public" location="f2:145" file="f2" line="145"/>
  <Field id="_305" name="ADO" type="_133" offset="48" context="_87" access="public" location="f2:147" file="f2" line="147"/>
  <Field id="_306" name="dlength" type="_133" offset="64" context="_87" access="public" location="f2:149" file="f2" line="149"/>
  <Field id="_307" name="irpt" type="_133" offset="80" context="_87" access="public" location="f2:151" file="f2" line="151"/>
  <Destructor id="_308" name="._4" artificial="1" throw="" context="_87" access="public" mangled="_ZN7ec_comtD1Ev *INTERNAL* " demangled="ec_comt::~ec_comt()" location="f2:152" file="f2" line="152" endline="152" inline="1">
  </Destructor>
  <OperatorMethod id="_309" name="=" returns="_375" artificial="1" throw="" context="_87" access="public" mangled="_ZN7ec_comtaSERKS_" demangled="ec_comt::operator=(ec_comt const&amp;)" location="f2:152" file="f2" line="152" endline="152" inline="1">
    <Argument type="_376" location="f2:137" file="f2" line="137"/>
  </OperatorMethod>
  <Constructor id="_310" name="._4" artificial="1" throw="" context="_87" access="public" mangled="_ZN7ec_comtC1ERKS_ *INTERNAL* " demangled="ec_comt::ec_comt(ec_comt const&amp;)" location="f2:152" file="f2" line="152" endline="152" inline="1">
    <Argument type="_376" location="f2:137" file="f2" line="137"/>
  </Constructor>
  <Constructor id="_311" name="._4" artificial="1" throw="" context="_87" access="public" mangled="_ZN7ec_comtC1Ev *INTERNAL* " demangled="ec_comt::ec_comt()" location="f2:152" file="f2" line="152" inline="1"/>
  <PointerType id="_312" type="_295c" size="64" align="64"/>
  <PointerType id="_313" type="_35" size="64" align="64"/>
  <PointerType id="_314" type="_6" size="64" align="64"/>
  <PointerType id="_315" type="_262" size="64" align="64"/>
  <PointerType id="_316" type="_263" size="64" align="64"/>
  <PointerType id="_317" type="_182c" size="64" align="64"/>
  <Field id="_318" name="Time" type="_6" offset="0" context="_123" access="public" location="f2:498" file="f2" line="498"/>
  <Field id="_319" name="Signal" type="_138" offset="128" context="_123" access="public" location="f2:500" file="f2" line="500"/>
  <Field id="_320" name="Slave" type="_133" offset="144" context="_123" access="public" location="f2:502" file="f2" line="502"/>
  <Field id="_321" name="Index" type="_133" offset="160" context="_123" access="public" location="f2:504" file="f2" line="504"/>
  <Field id="_322" name="SubIdx" type="_16" offset="176" context="_123" access="public" location="f2:506" file="f2" line="506"/>
  <Field id="_323" name="Etype" type="_130" offset="192" context="_123" access="public" location="f2:508" file="f2" line="508"/>
  <Field id="_324" name="" type="_325" offset="224" context="_123" access="public" location="f2:522" file="f2" line="522"/>
  <Union id="_325" context="_123" access="public" mangled="N9ec_errort4._22E" demangled="ec_errort::._22" location="f2:510" file="f2" line="510" artificial="1" size="64" align="32" members="_379 _380 _381 " bases=""/>
  <Destructor id="_326" name="._21" artificial="1" throw="" context="_123" access="public" mangled="_ZN9ec_errortD1Ev *INTERNAL* " demangled="ec_errort::~ec_errort()" location="f2:523" file="f2" line="523" endline="523" inline="1">
  </Destructor>
  <OperatorMethod id="_327" name="=" returns="_382" artificial="1" throw="" context="_123" access="public" mangled="_ZN9ec_errortaSERKS_" demangled="ec_errort::operator=(ec_errort const&amp;)" location="f2:523" file="f2" line="523" endline="523" inline="1">
    <Argument type="_383" location="f2:496" file="f2" line="496"/>
  </OperatorMethod>
  <Constructor id="_328" name="._21" artificial="1" throw="" context="_123" access="public" mangled="_ZN9ec_errortC1ERKS_ *INTERNAL* " demangled="ec_errort::ec_errort(ec_errort const&amp;)" location="f2:523" file="f2" line="523" endline="523" inline="1">
    <Argument type="_383" location="f2:496" file="f2" line="496"/>
  </Constructor>
  <Constructor id="_329" name="._21" artificial="1" throw="" context="_123" access="public" mangled="_ZN9ec_errortC1Ev *INTERNAL* " demangled="ec_errort::ec_errort()" location="f2:523" file="f2" line="523" inline="1"/>
  <Field id="_330" name="tv_sec" type="_160" offset="0" context="_127" access="public" location="f7:122" file="f7" line="122"/>
  <Field id="_331" name="tv_nsec" type="_19" offset="64" context="_127" access="public" location="f7:123" file="f7" line="123"/>
  <Destructor id="_332" name="timespec" artificial="1" throw="" context="_127" access="public" mangled="_ZN8timespecD1Ev *INTERNAL* " demangled="timespec::~timespec()" location="f7:121" file="f7" line="121" endline="121" inline="1">
  </Destructor>
  <OperatorMethod id="_333" name="=" returns="_384" artificial="1" throw="" context="_127" access="public" mangled="_ZN8timespecaSERKS_" demangled="timespec::operator=(timespec const&amp;)" location="f7:121" file="f7" line="121" endline="121" inline="1">
    <Argument type="_385" location="f7:121" file="f7" line="121"/>
  </OperatorMethod>
  <Constructor id="_334" name="timespec" artificial="1" throw="" context="_127" access="public" mangled="_ZN8timespecC1ERKS_ *INTERNAL* " demangled="timespec::timespec(timespec const&amp;)" location="f7:121" file="f7" line="121" endline="121" inline="1">
    <Argument type="_385" location="f7:121" file="f7" line="121"/>
  </Constructor>
  <Constructor id="_335" name="timespec" artificial="1" throw="" context="_127" access="public" mangled="_ZN8timespecC1Ev *INTERNAL* " demangled="timespec::timespec()" location="f7:121" file="f7" line="121" inline="1"/>
  <PointerType id="_336" type="_82" size="64" align="64"/>
  <CvQualifiedType id="_336r" type="_336" restrict="1"/>
  <PointerType id="_338" type="_127c" size="64" align="64"/>
  <CvQualifiedType id="_338r" type="_338" restrict="1"/>
  <PointerType id="_340" type="_24c" size="64" align="64"/>
  <CvQualifiedType id="_340r" type="_340" restrict="1"/>
  <Field id="_342" name="__val" type="_388" offset="0" context="_161" access="public" location="f3:144" file="f3" line="144"/>
  <Destructor id="_343" name="._0" artificial="1" throw="" context="_161" access="public" mangled="_ZN8__fsid_tD1Ev *INTERNAL* " demangled="__fsid_t::~__fsid_t()" location="f3:144" file="f3" line="144" endline="144" inline="1">
  </Destructor>
  <OperatorMethod id="_344" name="=" returns="_389" artificial="1" throw="" context="_161" access="public" mangled="_ZN8__fsid_taSERKS_" demangled="__fsid_t::operator=(__fsid_t const&amp;)" location="f3:144" file="f3" line="144" endline="144" inline="1">
    <Argument type="_390" location="f3:144" file="f3" line="144"/>
  </OperatorMethod>
  <Constructor id="_345" name="._0" artificial="1" throw="" context="_161" access="public" mangled="_ZN8__fsid_tC1ERKS_ *INTERNAL* " demangled="__fsid_t::__fsid_t(__fsid_t const&amp;)" location="f3:144" file="f3" line="144" endline="144" inline="1">
    <Argument type="_390" location="f3:144" file="f3" line="144"/>
  </Constructor>
  <Constructor id="_346" name="._0" artificial="1" throw="" context="_161" access="public" mangled="_ZN8__fsid_tC1Ev *INTERNAL* " demangled="__fsid_t::__fsid_t()" location="f3:144" file="f3" line="144" inline="1"/>
  <Field id="_347" name="tz_minuteswest" type="_35" offset="0" context="_182" access="public" location="f6:59" file="f6" line="59"/>
  <Field id="_348" name="tz_dsttime" type="_35" offset="32" context="_182" access="public" location="f6:60" file="f6" line="60"/>
  <Destructor id="_349" name="timezone" artificial="1" throw="" context="_182" access="public" mangled="_ZN8timezoneD1Ev *INTERNAL* " demangled="timezone::~timezone()" location="f6:58" file="f6" line="58" endline="58" inline="1">
  </Destructor>
  <OperatorMethod id="_350" name="=" returns="_391" artificial="1" throw="" context="_182" access="public" mangled="_ZN8timezoneaSERKS_" demangled="timezone::operator=(timezone const&amp;)" location="f6:58" file="f6" line="58" endline="58" inline="1">
    <Argument type="_392" location="f6:58" file="f6" line="58"/>
  </OperatorMethod>
  <Constructor id="_351" name="timezone" artificial="1" throw="" context="_182" access="public" mangled="_ZN8timezoneC1ERKS_ *INTERNAL* " demangled="timezone::timezone(timezone const&amp;)" location="f6:58" file="f6" line="58" endline="58" inline="1">
    <Argument type="_392" location="f6:58" file="f6" line="58"/>
  </Constructor>
  <Constructor id="_352" name="timezone" artificial="1" throw="" context="_182" access="public" mangled="_ZN8timezoneC1Ev *INTERNAL* " demangled="timezone::timezone()" location="f6:58" file="f6" line="58" inline="1"/>
  <Field id="_353" name="it_interval" type="_6" offset="0" context="_187" access="public" location="f6:112" file="f6" line="112"/>
  <Field id="_354" name="it_value" type="_6" offset="128" context="_187" access="public" location="f6:114" file="f6" line="114"/>
  <Destructor id="_355" name="itimerval" artificial="1" throw="" context="_187" access="public" mangled="_ZN9itimervalD1Ev *INTERNAL* " demangled="itimerval::~itimerval()" location="f6:110" file="f6" line="110" endline="110" inline="1">
  </Destructor>
  <OperatorMethod id="_356" name="=" returns="_393" artificial="1" throw="" context="_187" access="public" mangled="_ZN9itimervalaSERKS_" demangled="itimerval::operator=(itimerval const&amp;)" location="f6:110" file="f6" line="110" endline="110" inline="1">
    <Argument type="_394" location="f6:110" file="f6" line="110"/>
  </OperatorMethod>
  <Constructor id="_357" name="itimerval" artificial="1" throw="" context="_187" access="public" mangled="_ZN9itimervalC1ERKS_ *INTERNAL* " demangled="itimerval::itimerval(itimerval const&amp;)" location="f6:110" file="f6" line="110" endline="110" inline="1">
    <Argument type="_394" location="f6:110" file="f6" line="110"/>
  </Constructor>
  <Constructor id="_358" name="itimerval" artificial="1" throw="" context="_187" access="public" mangled="_ZN9itimervalC1Ev *INTERNAL* " demangled="itimerval::itimerval()" location="f6:110" file="f6" line="110" inline="1"/>
  <CvQualifiedType id="_314r" type="_314" restrict="1"/>
  <CvQualifiedType id="_231r" type="_231" restrict="1"/>
  <ReferenceType id="_363" type="_6" size="64" align="64"/>
  <ReferenceType id="_364" type="_6c" size="64" align="64"/>
  <ArrayType id="_365" min="0" max="15u" type="_39" size="1024" align="64"/>
  <ReferenceType id="_366" type="_24" size="64" align="64"/>
  <ReferenceType id="_367" type="_24c" size="64" align="64"/>
  <ReferenceType id="_368" type="_76" size="64" align="64"/>
  <ReferenceType id="_369" type="_76c" size="64" align="64"/>
  <ArrayType id="_372" min="0" max="15u" type="_191" size="1024" align="64"/>
  <ReferenceType id="_373" type="_82" size="64" align="64"/>
  <ReferenceType id="_374" type="_82c" size="64" align="64"/>
  <ReferenceType id="_375" type="_87" size="64" align="64"/>
  <ReferenceType id="_376" type="_87c" size="64" align="64"/>
  <Field id="_379" name="AbortCode" type="_36" offset="0" context="_325" access="public" location="f2:512" file="f2" line="512"/>
  <Field id="_380" name="" type="_381" offset="0" context="_325" access="public" location="f2:521" file="f2" line="521"/>
  <Struct id="_381" context="_325" access="public" mangled="N9ec_errort4._224._23E" demangled="ec_errort::._22::._23" location="f2:515" file="f2" line="515" artificial="1" size="64" align="16" members="_398 _399 _400 _401 _402 " bases=""/>
  <ReferenceType id="_382" type="_123" size="64" align="64"/>
  <ReferenceType id="_383" type="_123c" size="64" align="64"/>
  <ReferenceType id="_384" type="_127" size="64" align="64"/>
  <ReferenceType id="_385" type="_127c" size="64" align="64"/>
  <ArrayType id="_388" min="0" max="1u" type="_35" size="64" align="32"/>
  <ReferenceType id="_389" type="_161" size="64" align="64"/>
  <ReferenceType id="_390" type="_161c" size="64" align="64"/>
  <ReferenceType id="_391" type="_182" size="64" align="64"/>
  <ReferenceType id="_392" type="_182c" size="64" align="64"/>
  <ReferenceType id="_393" type="_187" size="64" align="64"/>
  <ReferenceType id="_394" type="_187c" size="64" align="64"/>
  <Field id="_398" name="ErrorCode" type="_133" offset="0" context="_381" access="public" location="f2:516" file="f2" line="516"/>
  <Field id="_399" name="ErrorReg" type="_16" offset="16" context="_381" access="public" location="f2:517" file="f2" line="517"/>
  <Field id="_400" name="b1" type="_16" offset="24" context="_381" access="public" location="f2:518" file="f2" line="518"/>
  <Field id="_401" name="w1" type="_133" offset="32" context="_381" access="public" location="f2:519" file="f2" line="519"/>
  <Field id="_402" name="w2" type="_133" offset="48" context="_381" access="public" location="f2:520" file="f2" line="520"/>
  <FundamentalType id="_361" name="char" size="8" align="8"/>
  <CvQualifiedType id="_361c" type="_361" const="1"/>
  <CvQualifiedType id="_295c" type="_295" const="1"/>
  <CvQualifiedType id="_161c" type="_161" const="1"/>
  <CvQualifiedType id="_6c" type="_6" const="1"/>
  <CvQualifiedType id="_24c" type="_24" const="1"/>
  <CvQualifiedType id="_127c" type="_127" const="1"/>
  <CvQualifiedType id="_82c" type="_82" const="1"/>
  <CvQualifiedType id="_182c" type="_182" const="1"/>
  <CvQualifiedType id="_187c" type="_187" const="1"/>
  <CvQualifiedType id="_76c" type="_76" const="1"/>
  <CvQualifiedType id="_87c" type="_87" const="1"/>
  <CvQualifiedType id="_123c" type="_123" const="1"/>
  <File id="f0" name="/usr/share/gccxml-0.9/GCC/4.6/gccxml_builtins.h"/>
  <File id="f1" name="/usr/include/x86_64-linux-gnu/bits/time.h"/>
  <File id="f2" name="/usr/local/include/soem/ethercattype.h"/>
  <File id="f3" name="/usr/include/x86_64-linux-gnu/bits/types.h"/>
  <File id="f4" name="/usr/include/x86_64-linux-gnu/bits/sigset.h"/>
  <File id="f5" name="/usr/include/x86_64-linux-gnu/sys/select.h"/>
  <File id="f6" name="/usr/include/x86_64-linux-gnu/sys/time.h"/>
  <File id="f7" name="/usr/include/time.h"/>
  <File id="f8" name="/usr/local/include/soem/ethercatfoe.h"/>
  <CPP_DUMP name="functions"><![CDATA[]]></CPP_DUMP>
  <CPP_DUMP name="aliases"><![CDATA[]]></CPP_DUMP>
  <CPP_DUMP name="excluded"><![CDATA[]]></CPP_DUMP>
</GCC_XML>
