<?xml version="1.0"?>
<GCC_XML cvs_revision="1.135">
  <Namespace id="_1" name="::" members="_3 _4 _5 _6 _7 _8 _9 _11 _12 _13 _14 _16 _17 _18 _20 _21 _22 _23 _25 _26 _27 _28 _29 _31 _32 _33 _34 _35 _37 _39 _41 _43 _44 _45 _46 _47 _49 _50 _51 _52 _53 _54 _55 _56 _57 _58 _59 _60 _61 _62 _63 _64 _65 _66 _67 _68 _69 _70 _71 _73 _74 _75 _79 _80 _81 _82 _83 _85 _86 _78 _87 _88 _89 _90 _91 _93 _94 _95 _96 _97 _98 _99 _100 _101 _102 _103 _104 _105 _106 _107 _108 _110 _111 _112 _113 _114 _115 _116 _117 _118 _119 _120 _121 _122 _123 _124 _125 _126 _127 _128 _130 _131 _132 _133 _134 _135 _136 _138 _139 _140 _141 _142 _143 _144 _145 _146 _147 _148 _150 _151 _152 _153 _154 _155 _156 _157 _158 _159 _160 _161 _162 _163 _164 _165 _166 _168 _2 _169 _170 _24 _92 _77 _72 _38 _76 _10 _171 _172 _173 _174 _175 _176 _177 _178 _179 _180 _181 _182 _183 _184 _185 _186 _187 _188 _189 _190 _191 _192 _193 _194 _195 _196 _197 _198 _199 _200 _201 _202 _203 _204 _205 _206 _207 _208 _209 _211 _212 _213 _214 _215 _216 _217 _219 _220 _221 _222 _223 _224 _225 _226 _227 _228 _229 _230 _232 _233 _234 _235 _236 _237 _238 _167 _239 _240 _241 _242 _243 _244 _245 _137 _129 _247 _248 _249 _250 _251 _252 _253 _254 _255 _256 _257 _258 _259 _260 _261 _262 _263 _264 _265 _266 _267 _268 _269 _270 _271 _272 _273 _275 " mangled="_Z2::" demangled="::"/>
  <Namespace id="_2" name="std" context="_1" members="" mangled="_Z3std" demangled="std"/>

  <Function id="_251" name="__builtin_csinf" returns="_287" context="_1" mangled="csinf" location="f0:114" file="f0" line="114" extern="1" attributes="nothrow pure no vops">
    <Argument type="_287" location="f0:114" file="f0" line="114"/>
  </Function>
  <Function id="_252" name="__builtin_csinh" returns="_294" context="_1" mangled="csinh" location="f0:118" file="f0" line="118" extern="1" attributes="nothrow pure no vops">
    <Argument type="_294" location="f0:118" file="f0" line="118"/>
  </Function>
  <Function id="_253" name="__builtin_csinl" returns="_288" context="_1" mangled="csinl" location="f0:116" file="f0" line="116" extern="1" attributes="nothrow pure no vops">
    <Argument type="_288" location="f0:116" file="f0" line="116"/>
  </Function>
  <Function id="_254" name="__builtin_acos" returns="_276" context="_1" mangled="acos" location="f0:24" file="f0" line="24" extern="1" attributes="nothrow">
    <Argument type="_276" location="f0:24" file="f0" line="24"/>
  </Function>
  <Typedef id="_255" name="__rlim_t" type="_40" context="_1" location="f3:146" file="f3" line="146"/>
  <Function id="_256" name="__builtin_ctzll" returns="_36" context="_1" location="f0:98" file="f0" line="98" extern="1" attributes="nothrow const">
    <Argument type="_48" location="f0:98" file="f0" line="98"/>
  </Function>
  <Function id="_257" name="__builtin_cargf" returns="_278" context="_1" mangled="cargf" location="f0:93" file="f0" line="93" extern="1" attributes="nothrow pure no vops">
    <Argument type="_287" location="f0:93" file="f0" line="93"/>
  </Function>
  <Function id="_258" name="__builtin_cargl" returns="_279" context="_1" mangled="cargl" location="f0:95" file="f0" line="95" extern="1" attributes="nothrow pure no vops">
    <Argument type="_288" location="f0:95" file="f0" line="95"/>
  </Function>
  <Typedef id="_259" name="__nlink_t" type="_40" context="_1" location="f3:140" file="f3" line="140"/>
  <Function id="_260" name="__builtin_cosf" returns="_278" context="_1" mangled="cosf" location="f0:40" file="f0" line="40" extern="1" attributes="nothrow pure no vops">
    <Argument type="_278" location="f0:40" file="f0" line="40"/>
  </Function>
  <Function id="_261" name="__builtin_cosh" returns="_276" context="_1" mangled="cosh" location="f0:41" file="f0" line="41" extern="1" attributes="nothrow">
    <Argument type="_276" location="f0:41" file="f0" line="41"/>
  </Function>
  <Function id="_262" name="__builtin_cosl" returns="_279" context="_1" mangled="cosl" location="f0:44" file="f0" line="44" extern="1" attributes="nothrow pure no vops">
    <Argument type="_279" location="f0:44" file="f0" line="44"/>
  </Function>
  <Function id="_263" name="select" returns="_36" context="_1" location="f5:112" file="f5" line="112" extern="1">
    <Argument name="__nfds" type="_36" location="f5:112" file="f5" line="112"/>
    <Argument name="__readfds" type="_352r" location="f5:112" file="f5" line="112"/>
    <Argument name="__writefds" type="_352r" location="f5:112" file="f5" line="112"/>
    <Argument name="__exceptfds" type="_352r" location="f5:112" file="f5" line="112"/>
    <Argument name="__timeout" type="_330r" location="f5:112" file="f5" line="112"/>
  </Function>
  <Function id="_264" name="__builtin_isgreater" returns="_286" context="_1" location="f0:137" file="f0" line="137" extern="1" attributes="nothrow const">
    <Ellipsis/>
  </Function>
  <Typedef id="_265" name="__blksize_t" type="_19" context="_1" location="f3:164" file="f3" line="164"/>
  <Typedef id="_266" name="__ino64_t" type="_40" context="_1" location="f3:138" file="f3" line="138"/>
  <Function id="_267" name="__builtin_sinf" returns="_278" context="_1" mangled="sinf" location="f0:76" file="f0" line="76" extern="1" attributes="nothrow pure no vops">
    <Argument type="_278" location="f0:76" file="f0" line="76"/>
  </Function>
  <Function id="_268" name="__builtin_sinh" returns="_276" context="_1" mangled="sinh" location="f0:77" file="f0" line="77" extern="1" attributes="nothrow">
    <Argument type="_276" location="f0:77" file="f0" line="77"/>
  </Function>
  <Function id="_269" name="__builtin_sinl" returns="_279" context="_1" mangled="sinl" location="f0:80" file="f0" line="80" extern="1" attributes="nothrow pure no vops">
    <Argument type="_279" location="f0:80" file="f0" line="80"/>
  </Function>
  <Function id="_270" name="__builtin_csin" returns="_294" context="_1" mangled="csin" location="f0:115" file="f0" line="115" extern="1" attributes="nothrow pure no vops">
    <Argument type="_294" location="f0:115" file="f0" line="115"/>
  </Function>
  <Typedef id="_271" name="__clock_t" type="_19" context="_1" location="f3:145" file="f3" line="145"/>
  <Function id="_272" name="ec_adddatagram" returns="_36" context="_1" mangled="_Z14ec_adddatagramPvhhhtttS_" demangled="ec_adddatagram(void*, unsigned char, unsigned char, unsigned char, unsigned short, unsigned short, unsigned short, void*)" location="f6:50" file="f6" line="50" extern="1">
    <Argument name="frame" type="_218" location="f6:50" file="f6" line="50"/>
    <Argument name="com" type="_16" location="f6:50" file="f6" line="50"/>
    <Argument name="idx" type="_16" location="f6:50" file="f6" line="50"/>
    <Argument name="more" type="_146" location="f6:50" file="f6" line="50"/>
    <Argument name="ADP" type="_141" location="f6:50" file="f6" line="50"/>
    <Argument name="ADO" type="_141" location="f6:50" file="f6" line="50"/>
    <Argument name="length" type="_141" location="f6:50" file="f6" line="50"/>
    <Argument name="data" type="_218" location="f6:50" file="f6" line="50"/>
  </Function>
  <Typedef id="_273" name="__int32_t" type="_36" context="_1" location="f3:41" file="f3" line="41"/>
  <PointerType id="_274" type="_378" size="64" align="64"/>
  <Typedef id="_275" name="__caddr_t" type="_274" context="_1" location="f3:186" file="f3" line="186"/>
  <FundamentalType id="_276" name="double" size="64" align="64"/>
  <PointerType id="_277" type="_378c" size="64" align="64"/>
  <FundamentalType id="_278" name="float" size="32" align="32"/>
  <FundamentalType id="_279" name="long double" size="128" align="128"/>
  <Field id="_280" name="tv_sec" type="_169" offset="0" context="_6" access="public" location="f1:77" file="f1" line="77"/>
  <Field id="_281" name="tv_usec" type="_57" offset="64" context="_6" access="public" location="f1:78" file="f1" line="78"/>
  <Destructor id="_282" name="timeval" artificial="1" throw="" context="_6" access="public" mangled="_ZN7timevalD1Ev *INTERNAL* " demangled="timeval::~timeval()" location="f1:76" file="f1" line="76" endline="76" inline="1">
  </Destructor>
  <OperatorMethod id="_283" name="=" returns="_380" artificial="1" throw="" context="_6" access="public" mangled="_ZN7timevalaSERKS_" demangled="timeval::operator=(timeval const&amp;)" location="f1:76" file="f1" line="76" endline="76" inline="1">
    <Argument type="_381" location="f1:76" file="f1" line="76"/>
  </OperatorMethod>
  <Constructor id="_284" name="timeval" artificial="1" throw="" context="_6" access="public" mangled="_ZN7timevalC1ERKS_ *INTERNAL* " demangled="timeval::timeval(timeval const&amp;)" location="f1:76" file="f1" line="76" endline="76" inline="1">
    <Argument type="_381" location="f1:76" file="f1" line="76"/>
  </Constructor>
  <Constructor id="_285" name="timeval" artificial="1" throw="" context="_6" access="public" mangled="_ZN7timevalC1Ev *INTERNAL* " demangled="timeval::timeval()" location="f1:76" file="f1" line="76" inline="1"/>
  <FundamentalType id="_286" name="bool" size="8" align="8"/>
  <FundamentalType id="_287" name="complex float" size="64" align="32"/>
  <FundamentalType id="_288" name="complex long double" size="256" align="128"/>
  <Field id="_289" name="__val" type="_382" offset="0" context="_24" access="public" location="f4:31" file="f4" line="31"/>
  <Destructor id="_290" name="._1" artificial="1" throw="" context="_24" access="public" mangled="_ZN10__sigset_tD1Ev *INTERNAL* " demangled="__sigset_t::~__sigset_t()" location="f4:32" file="f4" line="32" endline="32" inline="1">
  </Destructor>
  <OperatorMethod id="_291" name="=" returns="_383" artificial="1" throw="" context="_24" access="public" mangled="_ZN10__sigset_taSERKS_" demangled="__sigset_t::operator=(__sigset_t const&amp;)" location="f4:32" file="f4" line="32" endline="32" inline="1">
    <Argument type="_384" location="f4:30" file="f4" line="30"/>
  </OperatorMethod>
  <Constructor id="_292" name="._1" artificial="1" throw="" context="_24" access="public" mangled="_ZN10__sigset_tC1ERKS_ *INTERNAL* " demangled="__sigset_t::__sigset_t(__sigset_t const&amp;)" location="f4:32" file="f4" line="32" endline="32" inline="1">
    <Argument type="_384" location="f4:30" file="f4" line="30"/>
  </Constructor>
  <Constructor id="_293" name="._1" artificial="1" throw="" context="_24" access="public" mangled="_ZN10__sigset_tC1Ev *INTERNAL* " demangled="__sigset_t::__sigset_t()" location="f4:32" file="f4" line="32" inline="1"/>
  <FundamentalType id="_294" name="complex double" size="128" align="64"/>
  <PointerType id="_295" type="_200" size="64" align="64"/>
  <Field id="_296" name="da0" type="_141" offset="0" context="_78" access="public" location="f2:125" file="f2" line="125"/>
  <Field id="_297" name="da1" type="_141" offset="16" context="_78" access="public" location="f2:125" file="f2" line="125"/>
  <Field id="_298" name="da2" type="_141" offset="32" context="_78" access="public" location="f2:125" file="f2" line="125"/>
  <Field id="_299" name="sa0" type="_141" offset="48" context="_78" access="public" location="f2:127" file="f2" line="127"/>
  <Field id="_300" name="sa1" type="_141" offset="64" context="_78" access="public" location="f2:127" file="f2" line="127"/>
  <Field id="_301" name="sa2" type="_141" offset="80" context="_78" access="public" location="f2:127" file="f2" line="127"/>
  <Field id="_302" name="etype" type="_141" offset="96" context="_78" access="public" location="f2:129" file="f2" line="129"/>
  <Destructor id="_303" name="._3" artificial="1" throw="" context="_78" access="public" mangled="_ZN15ec_etherheadertD1Ev *INTERNAL* " demangled="ec_etherheadert::~ec_etherheadert()" location="f2:130" file="f2" line="130" endline="130" inline="1">
  </Destructor>
  <OperatorMethod id="_304" name="=" returns="_385" artificial="1" throw="" context="_78" access="public" mangled="_ZN15ec_etherheadertaSERKS_" demangled="ec_etherheadert::operator=(ec_etherheadert const&amp;)" location="f2:130" file="f2" line="130" endline="130" inline="1">
    <Argument type="_386" location="f2:123" file="f2" line="123"/>
  </OperatorMethod>
  <Constructor id="_305" name="._3" artificial="1" throw="" context="_78" access="public" mangled="_ZN15ec_etherheadertC1ERKS_ *INTERNAL* " demangled="ec_etherheadert::ec_etherheadert(ec_etherheadert const&amp;)" location="f2:130" file="f2" line="130" endline="130" inline="1">
    <Argument type="_386" location="f2:123" file="f2" line="123"/>
  </Constructor>
  <Constructor id="_306" name="._3" artificial="1" throw="" context="_78" access="public" mangled="_ZN15ec_etherheadertC1Ev *INTERNAL* " demangled="ec_etherheadert::ec_etherheadert()" location="f2:130" file="f2" line="130" inline="1"/>
  <PointerType id="_307" type="_200c" size="64" align="64"/>
  <CvQualifiedType id="_307r" type="_307" restrict="1"/>
  <CvQualifiedType id="_295r" type="_295" restrict="1"/>
  <PointerType id="_310" type="_6c" size="64" align="64"/>
  <FundamentalType id="_311" name="void" align="8"/>
  <Field id="_312" name="fds_bits" type="_389" offset="0" context="_86" access="public" location="f5:72" file="f5" line="72"/>
  <Destructor id="_313" name="._2" artificial="1" throw="" context="_86" access="public" mangled="_ZN6fd_setD1Ev *INTERNAL* " demangled="fd_set::~fd_set()" location="f5:78" file="f5" line="78" endline="78" inline="1">
  </Destructor>
  <OperatorMethod id="_314" name="=" returns="_390" artificial="1" throw="" context="_86" access="public" mangled="_ZN6fd_setaSERKS_" demangled="fd_set::operator=(fd_set const&amp;)" location="f5:78" file="f5" line="78" endline="78" inline="1">
    <Argument type="_391" location="f5:68" file="f5" line="68"/>
  </OperatorMethod>
  <Constructor id="_315" name="._2" artificial="1" throw="" context="_86" access="public" mangled="_ZN6fd_setC1ERKS_ *INTERNAL* " demangled="fd_set::fd_set(fd_set const&amp;)" location="f5:78" file="f5" line="78" endline="78" inline="1">
    <Argument type="_391" location="f5:68" file="f5" line="68"/>
  </Constructor>
  <Constructor id="_316" name="._2" artificial="1" throw="" context="_86" access="public" mangled="_ZN6fd_setC1Ev *INTERNAL* " demangled="fd_set::fd_set()" location="f5:78" file="f5" line="78" inline="1"/>
  <Field id="_317" name="elength" type="_141" offset="0" context="_92" access="public" location="f2:139" file="f2" line="139"/>
  <Field id="_318" name="command" type="_16" offset="16" context="_92" access="public" location="f2:141" file="f2" line="141"/>
  <Field id="_319" name="index" type="_16" offset="24" context="_92" access="public" location="f2:143" file="f2" line="143"/>
  <Field id="_320" name="ADP" type="_141" offset="32" context="_92" access="public" location="f2:145" file="f2" line="145"/>
  <Field id="_321" name="ADO" type="_141" offset="48" context="_92" access="public" location="f2:147" file="f2" line="147"/>
  <Field id="_322" name="dlength" type="_141" offset="64" context="_92" access="public" location="f2:149" file="f2" line="149"/>
  <Field id="_323" name="irpt" type="_141" offset="80" context="_92" access="public" location="f2:151" file="f2" line="151"/>
  <Destructor id="_324" name="._4" artificial="1" throw="" context="_92" access="public" mangled="_ZN7ec_comtD1Ev *INTERNAL* " demangled="ec_comt::~ec_comt()" location="f2:152" file="f2" line="152" endline="152" inline="1">
  </Destructor>
  <OperatorMethod id="_325" name="=" returns="_392" artificial="1" throw="" context="_92" access="public" mangled="_ZN7ec_comtaSERKS_" demangled="ec_comt::operator=(ec_comt const&amp;)" location="f2:152" file="f2" line="152" endline="152" inline="1">
    <Argument type="_393" location="f2:137" file="f2" line="137"/>
  </OperatorMethod>
  <Constructor id="_326" name="._4" artificial="1" throw="" context="_92" access="public" mangled="_ZN7ec_comtC1ERKS_ *INTERNAL* " demangled="ec_comt::ec_comt(ec_comt const&amp;)" location="f2:152" file="f2" line="152" endline="152" inline="1">
    <Argument type="_393" location="f2:137" file="f2" line="137"/>
  </Constructor>
  <Constructor id="_327" name="._4" artificial="1" throw="" context="_92" access="public" mangled="_ZN7ec_comtC1Ev *INTERNAL* " demangled="ec_comt::ec_comt()" location="f2:152" file="f2" line="152" inline="1"/>
  <PointerType id="_328" type="_311c" size="64" align="64"/>
  <PointerType id="_329" type="_36" size="64" align="64"/>
  <PointerType id="_330" type="_6" size="64" align="64"/>
  <PointerType id="_331" type="_278" size="64" align="64"/>
  <PointerType id="_332" type="_279" size="64" align="64"/>
  <PointerType id="_333" type="_194c" size="64" align="64"/>
  <Field id="_334" name="Time" type="_6" offset="0" context="_129" access="public" location="f2:498" file="f2" line="498"/>
  <Field id="_335" name="Signal" type="_146" offset="128" context="_129" access="public" location="f2:500" file="f2" line="500"/>
  <Field id="_336" name="Slave" type="_141" offset="144" context="_129" access="public" location="f2:502" file="f2" line="502"/>
  <Field id="_337" name="Index" type="_141" offset="160" context="_129" access="public" location="f2:504" file="f2" line="504"/>
  <Field id="_338" name="SubIdx" type="_16" offset="176" context="_129" access="public" location="f2:506" file="f2" line="506"/>
  <Field id="_339" name="Etype" type="_137" offset="192" context="_129" access="public" location="f2:508" file="f2" line="508"/>
  <Field id="_340" name="" type="_341" offset="224" context="_129" access="public" location="f2:522" file="f2" line="522"/>
  <Union id="_341" context="_129" access="public" mangled="N9ec_errort4._22E" demangled="ec_errort::._22" location="f2:510" file="f2" line="510" artificial="1" size="64" align="32" members="_396 _397 _398 " bases=""/>
  <Destructor id="_342" name="._21" artificial="1" throw="" context="_129" access="public" mangled="_ZN9ec_errortD1Ev *INTERNAL* " demangled="ec_errort::~ec_errort()" location="f2:523" file="f2" line="523" endline="523" inline="1">
  </Destructor>
  <OperatorMethod id="_343" name="=" returns="_399" artificial="1" throw="" context="_129" access="public" mangled="_ZN9ec_errortaSERKS_" demangled="ec_errort::operator=(ec_errort const&amp;)" location="f2:523" file="f2" line="523" endline="523" inline="1">
    <Argument type="_400" location="f2:496" file="f2" line="496"/>
  </OperatorMethod>
  <Constructor id="_344" name="._21" artificial="1" throw="" context="_129" access="public" mangled="_ZN9ec_errortC1ERKS_ *INTERNAL* " demangled="ec_errort::ec_errort(ec_errort const&amp;)" location="f2:523" file="f2" line="523" endline="523" inline="1">
    <Argument type="_400" location="f2:496" file="f2" line="496"/>
  </Constructor>
  <Constructor id="_345" name="._21" artificial="1" throw="" context="_129" access="public" mangled="_ZN9ec_errortC1Ev *INTERNAL* " demangled="ec_errort::ec_errort()" location="f2:523" file="f2" line="523" inline="1"/>
  <Field id="_346" name="tv_sec" type="_169" offset="0" context="_133" access="public" location="f8:122" file="f8" line="122"/>
  <Field id="_347" name="tv_nsec" type="_19" offset="64" context="_133" access="public" location="f8:123" file="f8" line="123"/>
  <Destructor id="_348" name="timespec" artificial="1" throw="" context="_133" access="public" mangled="_ZN8timespecD1Ev *INTERNAL* " demangled="timespec::~timespec()" location="f8:121" file="f8" line="121" endline="121" inline="1">
  </Destructor>
  <OperatorMethod id="_349" name="=" returns="_401" artificial="1" throw="" context="_133" access="public" mangled="_ZN8timespecaSERKS_" demangled="timespec::operator=(timespec const&amp;)" location="f8:121" file="f8" line="121" endline="121" inline="1">
    <Argument type="_402" location="f8:121" file="f8" line="121"/>
  </OperatorMethod>
  <Constructor id="_350" name="timespec" artificial="1" throw="" context="_133" access="public" mangled="_ZN8timespecC1ERKS_ *INTERNAL* " demangled="timespec::timespec(timespec const&amp;)" location="f8:121" file="f8" line="121" endline="121" inline="1">
    <Argument type="_402" location="f8:121" file="f8" line="121"/>
  </Constructor>
  <Constructor id="_351" name="timespec" artificial="1" throw="" context="_133" access="public" mangled="_ZN8timespecC1Ev *INTERNAL* " demangled="timespec::timespec()" location="f8:121" file="f8" line="121" inline="1"/>
  <PointerType id="_352" type="_86" size="64" align="64"/>
  <CvQualifiedType id="_352r" type="_352" restrict="1"/>
  <PointerType id="_354" type="_133c" size="64" align="64"/>
  <CvQualifiedType id="_354r" type="_354" restrict="1"/>
  <PointerType id="_356" type="_24c" size="64" align="64"/>
  <CvQualifiedType id="_356r" type="_356" restrict="1"/>
  <Field id="_358" name="__val" type="_405" offset="0" context="_170" access="public" location="f3:144" file="f3" line="144"/>
  <Destructor id="_359" name="._0" artificial="1" throw="" context="_170" access="public" mangled="_ZN8__fsid_tD1Ev *INTERNAL* " demangled="__fsid_t::~__fsid_t()" location="f3:144" file="f3" line="144" endline="144" inline="1">
  </Destructor>
  <OperatorMethod id="_360" name="=" returns="_406" artificial="1" throw="" context="_170" access="public" mangled="_ZN8__fsid_taSERKS_" demangled="__fsid_t::operator=(__fsid_t const&amp;)" location="f3:144" file="f3" line="144" endline="144" inline="1">
    <Argument type="_407" location="f3:144" file="f3" line="144"/>
  </OperatorMethod>
  <Constructor id="_361" name="._0" artificial="1" throw="" context="_170" access="public" mangled="_ZN8__fsid_tC1ERKS_ *INTERNAL* " demangled="__fsid_t::__fsid_t(__fsid_t const&amp;)" location="f3:144" file="f3" line="144" endline="144" inline="1">
    <Argument type="_407" location="f3:144" file="f3" line="144"/>
  </Constructor>
  <Constructor id="_362" name="._0" artificial="1" throw="" context="_170" access="public" mangled="_ZN8__fsid_tC1Ev *INTERNAL* " demangled="__fsid_t::__fsid_t()" location="f3:144" file="f3" line="144" inline="1"/>
  <PointerType id="_363" type="_49" size="64" align="64"/>
  <Field id="_364" name="tz_minuteswest" type="_36" offset="0" context="_194" access="public" location="f7:59" file="f7" line="59"/>
  <Field id="_365" name="tz_dsttime" type="_36" offset="32" context="_194" access="public" location="f7:60" file="f7" line="60"/>
  <Destructor id="_366" name="timezone" artificial="1" throw="" context="_194" access="public" mangled="_ZN8timezoneD1Ev *INTERNAL* " demangled="timezone::~timezone()" location="f7:58" file="f7" line="58" endline="58" inline="1">
  </Destructor>
  <OperatorMethod id="_367" name="=" returns="_408" artificial="1" throw="" context="_194" access="public" mangled="_ZN8timezoneaSERKS_" demangled="timezone::operator=(timezone const&amp;)" location="f7:58" file="f7" line="58" endline="58" inline="1">
    <Argument type="_409" location="f7:58" file="f7" line="58"/>
  </OperatorMethod>
  <Constructor id="_368" name="timezone" artificial="1" throw="" context="_194" access="public" mangled="_ZN8timezoneC1ERKS_ *INTERNAL* " demangled="timezone::timezone(timezone const&amp;)" location="f7:58" file="f7" line="58" endline="58" inline="1">
    <Argument type="_409" location="f7:58" file="f7" line="58"/>
  </Constructor>
  <Constructor id="_369" name="timezone" artificial="1" throw="" context="_194" access="public" mangled="_ZN8timezoneC1Ev *INTERNAL* " demangled="timezone::timezone()" location="f7:58" file="f7" line="58" inline="1"/>
  <Field id="_370" name="it_interval" type="_6" offset="0" context="_200" access="public" location="f7:112" file="f7" line="112"/>
  <Field id="_371" name="it_value" type="_6" offset="128" context="_200" access="public" location="f7:114" file="f7" line="114"/>
  <Destructor id="_372" name="itimerval" artificial="1" throw="" context="_200" access="public" mangled="_ZN9itimervalD1Ev *INTERNAL* " demangled="itimerval::~itimerval()" location="f7:110" file="f7" line="110" endline="110" inline="1">
  </Destructor>
  <OperatorMethod id="_373" name="=" returns="_410" artificial="1" throw="" context="_200" access="public" mangled="_ZN9itimervalaSERKS_" demangled="itimerval::operator=(itimerval const&amp;)" location="f7:110" file="f7" line="110" endline="110" inline="1">
    <Argument type="_411" location="f7:110" file="f7" line="110"/>
  </OperatorMethod>
  <Constructor id="_374" name="itimerval" artificial="1" throw="" context="_200" access="public" mangled="_ZN9itimervalC1ERKS_ *INTERNAL* " demangled="itimerval::itimerval(itimerval const&amp;)" location="f7:110" file="f7" line="110" endline="110" inline="1">
    <Argument type="_411" location="f7:110" file="f7" line="110"/>
  </Constructor>
  <Constructor id="_375" name="itimerval" artificial="1" throw="" context="_200" access="public" mangled="_ZN9itimervalC1Ev *INTERNAL* " demangled="itimerval::itimerval()" location="f7:110" file="f7" line="110" inline="1"/>
  <CvQualifiedType id="_330r" type="_330" restrict="1"/>
  <CvQualifiedType id="_246r" type="_246" restrict="1"/>
  <ReferenceType id="_380" type="_6" size="64" align="64"/>
  <ReferenceType id="_381" type="_6c" size="64" align="64"/>
  <ArrayType id="_382" min="0" max="15u" type="_40" size="1024" align="64"/>
  <ReferenceType id="_383" type="_24" size="64" align="64"/>
  <ReferenceType id="_384" type="_24c" size="64" align="64"/>
  <ReferenceType id="_385" type="_78" size="64" align="64"/>
  <ReferenceType id="_386" type="_78c" size="64" align="64"/>
  <ArrayType id="_389" min="0" max="15u" type="_204" size="1024" align="64"/>
  <ReferenceType id="_390" type="_86" size="64" align="64"/>
  <ReferenceType id="_391" type="_86c" size="64" align="64"/>
  <ReferenceType id="_392" type="_92" size="64" align="64"/>
  <ReferenceType id="_393" type="_92c" size="64" align="64"/>
  <Field id="_396" name="AbortCode" type="_37" offset="0" context="_341" access="public" location="f2:512" file="f2" line="512"/>
  <Field id="_397" name="" type="_398" offset="0" context="_341" access="public" location="f2:521" file="f2" line="521"/>
  <Struct id="_398" context="_341" access="public" mangled="N9ec_errort4._224._23E" demangled="ec_errort::._22::._23" location="f2:515" file="f2" line="515" artificial="1" size="64" align="16" members="_415 _416 _417 _418 _419 " bases=""/>
  <ReferenceType id="_399" type="_129" size="64" align="64"/>
  <ReferenceType id="_400" type="_129c" size="64" align="64"/>
  <ReferenceType id="_401" type="_133" size="64" align="64"/>
  <ReferenceType id="_402" type="_133c" size="64" align="64"/>
  <ArrayType id="_405" min="0" max="1u" type="_36" size="64" align="32"/>
  <ReferenceType id="_406" type="_170" size="64" align="64"/>
  <ReferenceType id="_407" type="_170c" size="64" align="64"/>
  <ReferenceType id="_408" type="_194" size="64" align="64"/>
  <ReferenceType id="_409" type="_194c" size="64" align="64"/>
  <ReferenceType id="_410" type="_200" size="64" align="64"/>
  <ReferenceType id="_411" type="_200c" size="64" align="64"/>
  <Field id="_415" name="ErrorCode" type="_141" offset="0" context="_398" access="public" location="f2:516" file="f2" line="516"/>
  <Field id="_416" name="ErrorReg" type="_16" offset="16" context="_398" access="public" location="f2:517" file="f2" line="517"/>
  <Field id="_417" name="b1" type="_16" offset="24" context="_398" access="public" location="f2:518" file="f2" line="518"/>
  <Field id="_418" name="w1" type="_141" offset="32" context="_398" access="public" location="f2:519" file="f2" line="519"/>
  <Field id="_419" name="w2" type="_141" offset="48" context="_398" access="public" location="f2:520" file="f2" line="520"/>
  <FundamentalType id="_378" name="char" size="8" align="8"/>
  <CvQualifiedType id="_378c" type="_378" const="1"/>
  <CvQualifiedType id="_311c" type="_311" const="1"/>
  <CvQualifiedType id="_170c" type="_170" const="1"/>
  <CvQualifiedType id="_6c" type="_6" const="1"/>
  <CvQualifiedType id="_24c" type="_24" const="1"/>
  <CvQualifiedType id="_133c" type="_133" const="1"/>
  <CvQualifiedType id="_86c" type="_86" const="1"/>
  <CvQualifiedType id="_194c" type="_194" const="1"/>
  <CvQualifiedType id="_200c" type="_200" const="1"/>
  <CvQualifiedType id="_78c" type="_78" const="1"/>
  <CvQualifiedType id="_92c" type="_92" const="1"/>
  <CvQualifiedType id="_129c" type="_129" const="1"/>
  <File id="f0" name="/usr/share/gccxml-0.9/GCC/4.6/gccxml_builtins.h"/>
  <File id="f1" name="/usr/include/x86_64-linux-gnu/bits/time.h"/>
  <File id="f2" name="/usr/local/include/soem/ethercattype.h"/>
  <File id="f3" name="/usr/include/x86_64-linux-gnu/bits/types.h"/>
  <File id="f4" name="/usr/include/x86_64-linux-gnu/bits/sigset.h"/>
  <File id="f5" name="/usr/include/x86_64-linux-gnu/sys/select.h"/>
  <File id="f6" name="/usr/local/include/soem/ethercatbase.h"/>
  <File id="f7" name="/usr/include/x86_64-linux-gnu/sys/time.h"/>
  <File id="f8" name="/usr/include/time.h"/>
  <CPP_DUMP name="functions"><![CDATA[]]></CPP_DUMP>
  <CPP_DUMP name="aliases"><![CDATA[]]></CPP_DUMP>
  <CPP_DUMP name="excluded"><![CDATA[]]></CPP_DUMP>
</GCC_XML>
