<?xml version="1.0"?>
<GCC_XML cvs_revision="1.135">
  <Namespace id="_1" name="::" members="_3 _4 _5 _6 _7 _8 _9 _11 _12 _13 _14 _15 _17 _18 _19 _21 _22 _23 _24 _26 _27 _28 _29 _30 _32 _33 _34 _35 _37 _39 _41 _43 _44 _45 _46 _48 _49 _50 _51 _52 _53 _54 _55 _56 _57 _58 _59 _60 _61 _62 _63 _64 _65 _66 _67 _68 _69 _70 _72 _73 _74 _78 _79 _80 _82 _83 _77 _84 _85 _86 _87 _89 _90 _91 _92 _93 _94 _95 _96 _97 _98 _99 _100 _101 _102 _104 _105 _106 _107 _108 _109 _110 _111 _112 _113 _114 _115 _116 _117 _118 _119 _120 _121 _122 _123 _125 _126 _127 _128 _129 _130 _132 _133 _134 _135 _136 _137 _138 _139 _140 _141 _143 _144 _145 _146 _147 _148 _149 _150 _151 _152 _153 _154 _155 _156 _157 _158 _159 _160 _161 _2 _163 _164 _25 _88 _76 _71 _38 _75 _10 _165 _166 _167 _168 _169 _170 _171 _172 _173 _174 _175 _176 _177 _178 _179 _180 _181 _182 _183 _184 _185 _186 _187 _188 _189 _190 _191 _192 _193 _194 _195 _196 _197 _199 _200 _201 _202 _203 _204 _206 _207 _208 _209 _210 _211 _212 _213 _214 _215 _216 _217 _219 _220 _221 _222 _223 _224 _225 _162 _226 _227 _228 _229 _230 _231 _232 _131 _124 _234 _235 _236 _237 _238 _239 _240 _241 _242 _243 _244 _245 _246 _247 _248 _249 _250 _251 _252 _253 _254 _255 _256 _257 _258 _259 _260 _261 _263 " mangled="_Z2::" demangled="::"/>
  <Namespace id="_2" name="std" context="_1" members="" mangled="_Z3std" demangled="std"/>

  <Function id="_236" name="__builtin_ceill" returns="_267" context="_1" mangled="ceill" location="f0:38" file="f0" line="38" extern="1" attributes="nothrow const">
    <Argument type="_267" location="f0:38" file="f0" line="38"/>
  </Function>
  <Typedef id="_237" name="__u_quad_t" type="_40" context="_1" location="f4:54" file="f4" line="54"/>
  <Function id="_238" name="__builtin_csinf" returns="_275" context="_1" mangled="csinf" location="f0:114" file="f0" line="114" extern="1" attributes="nothrow pure no vops">
    <Argument type="_275" location="f0:114" file="f0" line="114"/>
  </Function>
  <Function id="_239" name="__builtin_csinh" returns="_282" context="_1" mangled="csinh" location="f0:118" file="f0" line="118" extern="1" attributes="nothrow pure no vops">
    <Argument type="_282" location="f0:118" file="f0" line="118"/>
  </Function>
  <Function id="_240" name="__builtin_csinl" returns="_276" context="_1" mangled="csinl" location="f0:116" file="f0" line="116" extern="1" attributes="nothrow pure no vops">
    <Argument type="_276" location="f0:116" file="f0" line="116"/>
  </Function>
  <Function id="_241" name="ec_recover_slave" returns="_36" context="_1" mangled="_Z16ec_recover_slavet" demangled="ec_recover_slave(unsigned short)" location="f3:56" file="f3" line="56" extern="1">
    <Argument name="slave" type="_134" location="f3:56" file="f3" line="56"/>
  </Function>
  <Function id="_242" name="__builtin_acos" returns="_264" context="_1" mangled="acos" location="f0:24" file="f0" line="24" extern="1" attributes="nothrow">
    <Argument type="_264" location="f0:24" file="f0" line="24"/>
  </Function>
  <Typedef id="_243" name="__rlim_t" type="_40" context="_1" location="f4:146" file="f4" line="146"/>
  <Function id="_244" name="__builtin_ctzll" returns="_36" context="_1" location="f0:98" file="f0" line="98" extern="1" attributes="nothrow const">
    <Argument type="_47" location="f0:98" file="f0" line="98"/>
  </Function>
  <Function id="_245" name="__builtin_cargf" returns="_266" context="_1" mangled="cargf" location="f0:93" file="f0" line="93" extern="1" attributes="nothrow pure no vops">
    <Argument type="_275" location="f0:93" file="f0" line="93"/>
  </Function>
  <Function id="_246" name="__builtin_cargl" returns="_267" context="_1" mangled="cargl" location="f0:95" file="f0" line="95" extern="1" attributes="nothrow pure no vops">
    <Argument type="_276" location="f0:95" file="f0" line="95"/>
  </Function>
  <Typedef id="_247" name="__nlink_t" type="_40" context="_1" location="f4:140" file="f4" line="140"/>
  <Function id="_248" name="__builtin_cosf" returns="_266" context="_1" mangled="cosf" location="f0:40" file="f0" line="40" extern="1" attributes="nothrow pure no vops">
    <Argument type="_266" location="f0:40" file="f0" line="40"/>
  </Function>
  <Function id="_249" name="__builtin_cosh" returns="_264" context="_1" mangled="cosh" location="f0:41" file="f0" line="41" extern="1" attributes="nothrow">
    <Argument type="_264" location="f0:41" file="f0" line="41"/>
  </Function>
  <Function id="_250" name="__builtin_cosl" returns="_267" context="_1" mangled="cosl" location="f0:44" file="f0" line="44" extern="1" attributes="nothrow pure no vops">
    <Argument type="_267" location="f0:44" file="f0" line="44"/>
  </Function>
  <Function id="_251" name="ec_config_init" returns="_36" context="_1" mangled="_Z14ec_config_inith" demangled="ec_config_init(unsigned char)" location="f3:52" file="f3" line="52" extern="1">
    <Argument name="usetable" type="_17" location="f3:52" file="f3" line="52"/>
  </Function>
  <Function id="_252" name="select" returns="_36" context="_1" location="f6:112" file="f6" line="112" extern="1">
    <Argument name="__nfds" type="_36" location="f6:112" file="f6" line="112"/>
    <Argument name="__readfds" type="_340r" location="f6:112" file="f6" line="112"/>
    <Argument name="__writefds" type="_340r" location="f6:112" file="f6" line="112"/>
    <Argument name="__exceptfds" type="_340r" location="f6:112" file="f6" line="112"/>
    <Argument name="__timeout" type="_318r" location="f6:112" file="f6" line="112"/>
  </Function>
  <Function id="_253" name="__builtin_isgreater" returns="_274" context="_1" location="f0:137" file="f0" line="137" extern="1" attributes="nothrow const">
    <Ellipsis/>
  </Function>
  <Typedef id="_254" name="__blksize_t" type="_20" context="_1" location="f4:164" file="f4" line="164"/>
  <Typedef id="_255" name="__ino64_t" type="_40" context="_1" location="f4:138" file="f4" line="138"/>
  <Function id="_256" name="__builtin_sinf" returns="_266" context="_1" mangled="sinf" location="f0:76" file="f0" line="76" extern="1" attributes="nothrow pure no vops">
    <Argument type="_266" location="f0:76" file="f0" line="76"/>
  </Function>
  <Function id="_257" name="__builtin_sinh" returns="_264" context="_1" mangled="sinh" location="f0:77" file="f0" line="77" extern="1" attributes="nothrow">
    <Argument type="_264" location="f0:77" file="f0" line="77"/>
  </Function>
  <Function id="_258" name="__builtin_sinl" returns="_267" context="_1" mangled="sinl" location="f0:80" file="f0" line="80" extern="1" attributes="nothrow pure no vops">
    <Argument type="_267" location="f0:80" file="f0" line="80"/>
  </Function>
  <Function id="_259" name="__builtin_csin" returns="_282" context="_1" mangled="csin" location="f0:115" file="f0" line="115" extern="1" attributes="nothrow pure no vops">
    <Argument type="_282" location="f0:115" file="f0" line="115"/>
  </Function>
  <Typedef id="_260" name="__clock_t" type="_20" context="_1" location="f4:145" file="f4" line="145"/>
  <Typedef id="_261" name="__int32_t" type="_36" context="_1" location="f4:41" file="f4" line="41"/>
  <PointerType id="_262" type="_365" size="64" align="64"/>
  <Typedef id="_263" name="__caddr_t" type="_262" context="_1" location="f4:186" file="f4" line="186"/>
  <FundamentalType id="_264" name="double" size="64" align="64"/>
  <PointerType id="_265" type="_365c" size="64" align="64"/>
  <FundamentalType id="_266" name="float" size="32" align="32"/>
  <FundamentalType id="_267" name="long double" size="128" align="128"/>
  <Field id="_268" name="tv_sec" type="_163" offset="0" context="_6" access="public" location="f1:77" file="f1" line="77"/>
  <Field id="_269" name="tv_usec" type="_56" offset="64" context="_6" access="public" location="f1:78" file="f1" line="78"/>
  <Destructor id="_270" name="timeval" artificial="1" throw="" context="_6" access="public" mangled="_ZN7timevalD1Ev *INTERNAL* " demangled="timeval::~timeval()" location="f1:76" file="f1" line="76" endline="76" inline="1">
  </Destructor>
  <OperatorMethod id="_271" name="=" returns="_367" artificial="1" throw="" context="_6" access="public" mangled="_ZN7timevalaSERKS_" demangled="timeval::operator=(timeval const&amp;)" location="f1:76" file="f1" line="76" endline="76" inline="1">
    <Argument type="_368" location="f1:76" file="f1" line="76"/>
  </OperatorMethod>
  <Constructor id="_272" name="timeval" artificial="1" throw="" context="_6" access="public" mangled="_ZN7timevalC1ERKS_ *INTERNAL* " demangled="timeval::timeval(timeval const&amp;)" location="f1:76" file="f1" line="76" endline="76" inline="1">
    <Argument type="_368" location="f1:76" file="f1" line="76"/>
  </Constructor>
  <Constructor id="_273" name="timeval" artificial="1" throw="" context="_6" access="public" mangled="_ZN7timevalC1Ev *INTERNAL* " demangled="timeval::timeval()" location="f1:76" file="f1" line="76" inline="1"/>
  <FundamentalType id="_274" name="bool" size="8" align="8"/>
  <FundamentalType id="_275" name="complex float" size="64" align="32"/>
  <FundamentalType id="_276" name="complex long double" size="256" align="128"/>
  <Field id="_277" name="__val" type="_369" offset="0" context="_25" access="public" location="f5:31" file="f5" line="31"/>
  <Destructor id="_278" name="._1" artificial="1" throw="" context="_25" access="public" mangled="_ZN10__sigset_tD1Ev *INTERNAL* " demangled="__sigset_t::~__sigset_t()" location="f5:32" file="f5" line="32" endline="32" inline="1">
  </Destructor>
  <OperatorMethod id="_279" name="=" returns="_370" artificial="1" throw="" context="_25" access="public" mangled="_ZN10__sigset_taSERKS_" demangled="__sigset_t::operator=(__sigset_t const&amp;)" location="f5:32" file="f5" line="32" endline="32" inline="1">
    <Argument type="_371" location="f5:30" file="f5" line="30"/>
  </OperatorMethod>
  <Constructor id="_280" name="._1" artificial="1" throw="" context="_25" access="public" mangled="_ZN10__sigset_tC1ERKS_ *INTERNAL* " demangled="__sigset_t::__sigset_t(__sigset_t const&amp;)" location="f5:32" file="f5" line="32" endline="32" inline="1">
    <Argument type="_371" location="f5:30" file="f5" line="30"/>
  </Constructor>
  <Constructor id="_281" name="._1" artificial="1" throw="" context="_25" access="public" mangled="_ZN10__sigset_tC1Ev *INTERNAL* " demangled="__sigset_t::__sigset_t()" location="f5:32" file="f5" line="32" inline="1"/>
  <FundamentalType id="_282" name="complex double" size="128" align="64"/>
  <PointerType id="_283" type="_189" size="64" align="64"/>
  <Field id="_284" name="da0" type="_134" offset="0" context="_77" access="public" location="f2:125" file="f2" line="125"/>
  <Field id="_285" name="da1" type="_134" offset="16" context="_77" access="public" location="f2:125" file="f2" line="125"/>
  <Field id="_286" name="da2" type="_134" offset="32" context="_77" access="public" location="f2:125" file="f2" line="125"/>
  <Field id="_287" name="sa0" type="_134" offset="48" context="_77" access="public" location="f2:127" file="f2" line="127"/>
  <Field id="_288" name="sa1" type="_134" offset="64" context="_77" access="public" location="f2:127" file="f2" line="127"/>
  <Field id="_289" name="sa2" type="_134" offset="80" context="_77" access="public" location="f2:127" file="f2" line="127"/>
  <Field id="_290" name="etype" type="_134" offset="96" context="_77" access="public" location="f2:129" file="f2" line="129"/>
  <Destructor id="_291" name="._3" artificial="1" throw="" context="_77" access="public" mangled="_ZN15ec_etherheadertD1Ev *INTERNAL* " demangled="ec_etherheadert::~ec_etherheadert()" location="f2:130" file="f2" line="130" endline="130" inline="1">
  </Destructor>
  <OperatorMethod id="_292" name="=" returns="_372" artificial="1" throw="" context="_77" access="public" mangled="_ZN15ec_etherheadertaSERKS_" demangled="ec_etherheadert::operator=(ec_etherheadert const&amp;)" location="f2:130" file="f2" line="130" endline="130" inline="1">
    <Argument type="_373" location="f2:123" file="f2" line="123"/>
  </OperatorMethod>
  <Constructor id="_293" name="._3" artificial="1" throw="" context="_77" access="public" mangled="_ZN15ec_etherheadertC1ERKS_ *INTERNAL* " demangled="ec_etherheadert::ec_etherheadert(ec_etherheadert const&amp;)" location="f2:130" file="f2" line="130" endline="130" inline="1">
    <Argument type="_373" location="f2:123" file="f2" line="123"/>
  </Constructor>
  <Constructor id="_294" name="._3" artificial="1" throw="" context="_77" access="public" mangled="_ZN15ec_etherheadertC1Ev *INTERNAL* " demangled="ec_etherheadert::ec_etherheadert()" location="f2:130" file="f2" line="130" inline="1"/>
  <PointerType id="_295" type="_189c" size="64" align="64"/>
  <CvQualifiedType id="_295r" type="_295" restrict="1"/>
  <CvQualifiedType id="_283r" type="_283" restrict="1"/>
  <PointerType id="_298" type="_6c" size="64" align="64"/>
  <FundamentalType id="_299" name="void" align="8"/>
  <Field id="_300" name="fds_bits" type="_376" offset="0" context="_83" access="public" location="f6:72" file="f6" line="72"/>
  <Destructor id="_301" name="._2" artificial="1" throw="" context="_83" access="public" mangled="_ZN6fd_setD1Ev *INTERNAL* " demangled="fd_set::~fd_set()" location="f6:78" file="f6" line="78" endline="78" inline="1">
  </Destructor>
  <OperatorMethod id="_302" name="=" returns="_377" artificial="1" throw="" context="_83" access="public" mangled="_ZN6fd_setaSERKS_" demangled="fd_set::operator=(fd_set const&amp;)" location="f6:78" file="f6" line="78" endline="78" inline="1">
    <Argument type="_378" location="f6:68" file="f6" line="68"/>
  </OperatorMethod>
  <Constructor id="_303" name="._2" artificial="1" throw="" context="_83" access="public" mangled="_ZN6fd_setC1ERKS_ *INTERNAL* " demangled="fd_set::fd_set(fd_set const&amp;)" location="f6:78" file="f6" line="78" endline="78" inline="1">
    <Argument type="_378" location="f6:68" file="f6" line="68"/>
  </Constructor>
  <Constructor id="_304" name="._2" artificial="1" throw="" context="_83" access="public" mangled="_ZN6fd_setC1Ev *INTERNAL* " demangled="fd_set::fd_set()" location="f6:78" file="f6" line="78" inline="1"/>
  <Field id="_305" name="elength" type="_134" offset="0" context="_88" access="public" location="f2:139" file="f2" line="139"/>
  <Field id="_306" name="command" type="_17" offset="16" context="_88" access="public" location="f2:141" file="f2" line="141"/>
  <Field id="_307" name="index" type="_17" offset="24" context="_88" access="public" location="f2:143" file="f2" line="143"/>
  <Field id="_308" name="ADP" type="_134" offset="32" context="_88" access="public" location="f2:145" file="f2" line="145"/>
  <Field id="_309" name="ADO" type="_134" offset="48" context="_88" access="public" location="f2:147" file="f2" line="147"/>
  <Field id="_310" name="dlength" type="_134" offset="64" context="_88" access="public" location="f2:149" file="f2" line="149"/>
  <Field id="_311" name="irpt" type="_134" offset="80" context="_88" access="public" location="f2:151" file="f2" line="151"/>
  <Destructor id="_312" name="._4" artificial="1" throw="" context="_88" access="public" mangled="_ZN7ec_comtD1Ev *INTERNAL* " demangled="ec_comt::~ec_comt()" location="f2:152" file="f2" line="152" endline="152" inline="1">
  </Destructor>
  <OperatorMethod id="_313" name="=" returns="_379" artificial="1" throw="" context="_88" access="public" mangled="_ZN7ec_comtaSERKS_" demangled="ec_comt::operator=(ec_comt const&amp;)" location="f2:152" file="f2" line="152" endline="152" inline="1">
    <Argument type="_380" location="f2:137" file="f2" line="137"/>
  </OperatorMethod>
  <Constructor id="_314" name="._4" artificial="1" throw="" context="_88" access="public" mangled="_ZN7ec_comtC1ERKS_ *INTERNAL* " demangled="ec_comt::ec_comt(ec_comt const&amp;)" location="f2:152" file="f2" line="152" endline="152" inline="1">
    <Argument type="_380" location="f2:137" file="f2" line="137"/>
  </Constructor>
  <Constructor id="_315" name="._4" artificial="1" throw="" context="_88" access="public" mangled="_ZN7ec_comtC1Ev *INTERNAL* " demangled="ec_comt::ec_comt()" location="f2:152" file="f2" line="152" inline="1"/>
  <PointerType id="_316" type="_299c" size="64" align="64"/>
  <PointerType id="_317" type="_36" size="64" align="64"/>
  <PointerType id="_318" type="_6" size="64" align="64"/>
  <PointerType id="_319" type="_266" size="64" align="64"/>
  <PointerType id="_320" type="_267" size="64" align="64"/>
  <PointerType id="_321" type="_184c" size="64" align="64"/>
  <Field id="_322" name="Time" type="_6" offset="0" context="_124" access="public" location="f2:498" file="f2" line="498"/>
  <Field id="_323" name="Signal" type="_139" offset="128" context="_124" access="public" location="f2:500" file="f2" line="500"/>
  <Field id="_324" name="Slave" type="_134" offset="144" context="_124" access="public" location="f2:502" file="f2" line="502"/>
  <Field id="_325" name="Index" type="_134" offset="160" context="_124" access="public" location="f2:504" file="f2" line="504"/>
  <Field id="_326" name="SubIdx" type="_17" offset="176" context="_124" access="public" location="f2:506" file="f2" line="506"/>
  <Field id="_327" name="Etype" type="_131" offset="192" context="_124" access="public" location="f2:508" file="f2" line="508"/>
  <Field id="_328" name="" type="_329" offset="224" context="_124" access="public" location="f2:522" file="f2" line="522"/>
  <Union id="_329" context="_124" access="public" mangled="N9ec_errort4._22E" demangled="ec_errort::._22" location="f2:510" file="f2" line="510" artificial="1" size="64" align="32" members="_383 _384 _385 " bases=""/>
  <Destructor id="_330" name="._21" artificial="1" throw="" context="_124" access="public" mangled="_ZN9ec_errortD1Ev *INTERNAL* " demangled="ec_errort::~ec_errort()" location="f2:523" file="f2" line="523" endline="523" inline="1">
  </Destructor>
  <OperatorMethod id="_331" name="=" returns="_386" artificial="1" throw="" context="_124" access="public" mangled="_ZN9ec_errortaSERKS_" demangled="ec_errort::operator=(ec_errort const&amp;)" location="f2:523" file="f2" line="523" endline="523" inline="1">
    <Argument type="_387" location="f2:496" file="f2" line="496"/>
  </OperatorMethod>
  <Constructor id="_332" name="._21" artificial="1" throw="" context="_124" access="public" mangled="_ZN9ec_errortC1ERKS_ *INTERNAL* " demangled="ec_errort::ec_errort(ec_errort const&amp;)" location="f2:523" file="f2" line="523" endline="523" inline="1">
    <Argument type="_387" location="f2:496" file="f2" line="496"/>
  </Constructor>
  <Constructor id="_333" name="._21" artificial="1" throw="" context="_124" access="public" mangled="_ZN9ec_errortC1Ev *INTERNAL* " demangled="ec_errort::ec_errort()" location="f2:523" file="f2" line="523" inline="1"/>
  <Field id="_334" name="tv_sec" type="_163" offset="0" context="_128" access="public" location="f8:122" file="f8" line="122"/>
  <Field id="_335" name="tv_nsec" type="_20" offset="64" context="_128" access="public" location="f8:123" file="f8" line="123"/>
  <Destructor id="_336" name="timespec" artificial="1" throw="" context="_128" access="public" mangled="_ZN8timespecD1Ev *INTERNAL* " demangled="timespec::~timespec()" location="f8:121" file="f8" line="121" endline="121" inline="1">
  </Destructor>
  <OperatorMethod id="_337" name="=" returns="_388" artificial="1" throw="" context="_128" access="public" mangled="_ZN8timespecaSERKS_" demangled="timespec::operator=(timespec const&amp;)" location="f8:121" file="f8" line="121" endline="121" inline="1">
    <Argument type="_389" location="f8:121" file="f8" line="121"/>
  </OperatorMethod>
  <Constructor id="_338" name="timespec" artificial="1" throw="" context="_128" access="public" mangled="_ZN8timespecC1ERKS_ *INTERNAL* " demangled="timespec::timespec(timespec const&amp;)" location="f8:121" file="f8" line="121" endline="121" inline="1">
    <Argument type="_389" location="f8:121" file="f8" line="121"/>
  </Constructor>
  <Constructor id="_339" name="timespec" artificial="1" throw="" context="_128" access="public" mangled="_ZN8timespecC1Ev *INTERNAL* " demangled="timespec::timespec()" location="f8:121" file="f8" line="121" inline="1"/>
  <PointerType id="_340" type="_83" size="64" align="64"/>
  <CvQualifiedType id="_340r" type="_340" restrict="1"/>
  <PointerType id="_342" type="_128c" size="64" align="64"/>
  <CvQualifiedType id="_342r" type="_342" restrict="1"/>
  <PointerType id="_344" type="_25c" size="64" align="64"/>
  <CvQualifiedType id="_344r" type="_344" restrict="1"/>
  <Field id="_346" name="__val" type="_392" offset="0" context="_164" access="public" location="f4:144" file="f4" line="144"/>
  <Destructor id="_347" name="._0" artificial="1" throw="" context="_164" access="public" mangled="_ZN8__fsid_tD1Ev *INTERNAL* " demangled="__fsid_t::~__fsid_t()" location="f4:144" file="f4" line="144" endline="144" inline="1">
  </Destructor>
  <OperatorMethod id="_348" name="=" returns="_393" artificial="1" throw="" context="_164" access="public" mangled="_ZN8__fsid_taSERKS_" demangled="__fsid_t::operator=(__fsid_t const&amp;)" location="f4:144" file="f4" line="144" endline="144" inline="1">
    <Argument type="_394" location="f4:144" file="f4" line="144"/>
  </OperatorMethod>
  <Constructor id="_349" name="._0" artificial="1" throw="" context="_164" access="public" mangled="_ZN8__fsid_tC1ERKS_ *INTERNAL* " demangled="__fsid_t::__fsid_t(__fsid_t const&amp;)" location="f4:144" file="f4" line="144" endline="144" inline="1">
    <Argument type="_394" location="f4:144" file="f4" line="144"/>
  </Constructor>
  <Constructor id="_350" name="._0" artificial="1" throw="" context="_164" access="public" mangled="_ZN8__fsid_tC1Ev *INTERNAL* " demangled="__fsid_t::__fsid_t()" location="f4:144" file="f4" line="144" inline="1"/>
  <Field id="_351" name="tz_minuteswest" type="_36" offset="0" context="_184" access="public" location="f7:59" file="f7" line="59"/>
  <Field id="_352" name="tz_dsttime" type="_36" offset="32" context="_184" access="public" location="f7:60" file="f7" line="60"/>
  <Destructor id="_353" name="timezone" artificial="1" throw="" context="_184" access="public" mangled="_ZN8timezoneD1Ev *INTERNAL* " demangled="timezone::~timezone()" location="f7:58" file="f7" line="58" endline="58" inline="1">
  </Destructor>
  <OperatorMethod id="_354" name="=" returns="_395" artificial="1" throw="" context="_184" access="public" mangled="_ZN8timezoneaSERKS_" demangled="timezone::operator=(timezone const&amp;)" location="f7:58" file="f7" line="58" endline="58" inline="1">
    <Argument type="_396" location="f7:58" file="f7" line="58"/>
  </OperatorMethod>
  <Constructor id="_355" name="timezone" artificial="1" throw="" context="_184" access="public" mangled="_ZN8timezoneC1ERKS_ *INTERNAL* " demangled="timezone::timezone(timezone const&amp;)" location="f7:58" file="f7" line="58" endline="58" inline="1">
    <Argument type="_396" location="f7:58" file="f7" line="58"/>
  </Constructor>
  <Constructor id="_356" name="timezone" artificial="1" throw="" context="_184" access="public" mangled="_ZN8timezoneC1Ev *INTERNAL* " demangled="timezone::timezone()" location="f7:58" file="f7" line="58" inline="1"/>
  <Field id="_357" name="it_interval" type="_6" offset="0" context="_189" access="public" location="f7:112" file="f7" line="112"/>
  <Field id="_358" name="it_value" type="_6" offset="128" context="_189" access="public" location="f7:114" file="f7" line="114"/>
  <Destructor id="_359" name="itimerval" artificial="1" throw="" context="_189" access="public" mangled="_ZN9itimervalD1Ev *INTERNAL* " demangled="itimerval::~itimerval()" location="f7:110" file="f7" line="110" endline="110" inline="1">
  </Destructor>
  <OperatorMethod id="_360" name="=" returns="_397" artificial="1" throw="" context="_189" access="public" mangled="_ZN9itimervalaSERKS_" demangled="itimerval::operator=(itimerval const&amp;)" location="f7:110" file="f7" line="110" endline="110" inline="1">
    <Argument type="_398" location="f7:110" file="f7" line="110"/>
  </OperatorMethod>
  <Constructor id="_361" name="itimerval" artificial="1" throw="" context="_189" access="public" mangled="_ZN9itimervalC1ERKS_ *INTERNAL* " demangled="itimerval::itimerval(itimerval const&amp;)" location="f7:110" file="f7" line="110" endline="110" inline="1">
    <Argument type="_398" location="f7:110" file="f7" line="110"/>
  </Constructor>
  <Constructor id="_362" name="itimerval" artificial="1" throw="" context="_189" access="public" mangled="_ZN9itimervalC1Ev *INTERNAL* " demangled="itimerval::itimerval()" location="f7:110" file="f7" line="110" inline="1"/>
  <CvQualifiedType id="_318r" type="_318" restrict="1"/>
  <CvQualifiedType id="_233r" type="_233" restrict="1"/>
  <ReferenceType id="_367" type="_6" size="64" align="64"/>
  <ReferenceType id="_368" type="_6c" size="64" align="64"/>
  <ArrayType id="_369" min="0" max="15u" type="_40" size="1024" align="64"/>
  <ReferenceType id="_370" type="_25" size="64" align="64"/>
  <ReferenceType id="_371" type="_25c" size="64" align="64"/>
  <ReferenceType id="_372" type="_77" size="64" align="64"/>
  <ReferenceType id="_373" type="_77c" size="64" align="64"/>
  <ArrayType id="_376" min="0" max="15u" type="_193" size="1024" align="64"/>
  <ReferenceType id="_377" type="_83" size="64" align="64"/>
  <ReferenceType id="_378" type="_83c" size="64" align="64"/>
  <ReferenceType id="_379" type="_88" size="64" align="64"/>
  <ReferenceType id="_380" type="_88c" size="64" align="64"/>
  <Field id="_383" name="AbortCode" type="_37" offset="0" context="_329" access="public" location="f2:512" file="f2" line="512"/>
  <Field id="_384" name="" type="_385" offset="0" context="_329" access="public" location="f2:521" file="f2" line="521"/>
  <Struct id="_385" context="_329" access="public" mangled="N9ec_errort4._224._23E" demangled="ec_errort::._22::._23" location="f2:515" file="f2" line="515" artificial="1" size="64" align="16" members="_402 _403 _404 _405 _406 " bases=""/>
  <ReferenceType id="_386" type="_124" size="64" align="64"/>
  <ReferenceType id="_387" type="_124c" size="64" align="64"/>
  <ReferenceType id="_388" type="_128" size="64" align="64"/>
  <ReferenceType id="_389" type="_128c" size="64" align="64"/>
  <ArrayType id="_392" min="0" max="1u" type="_36" size="64" align="32"/>
  <ReferenceType id="_393" type="_164" size="64" align="64"/>
  <ReferenceType id="_394" type="_164c" size="64" align="64"/>
  <ReferenceType id="_395" type="_184" size="64" align="64"/>
  <ReferenceType id="_396" type="_184c" size="64" align="64"/>
  <ReferenceType id="_397" type="_189" size="64" align="64"/>
  <ReferenceType id="_398" type="_189c" size="64" align="64"/>
  <Field id="_402" name="ErrorCode" type="_134" offset="0" context="_385" access="public" location="f2:516" file="f2" line="516"/>
  <Field id="_403" name="ErrorReg" type="_17" offset="16" context="_385" access="public" location="f2:517" file="f2" line="517"/>
  <Field id="_404" name="b1" type="_17" offset="24" context="_385" access="public" location="f2:518" file="f2" line="518"/>
  <Field id="_405" name="w1" type="_134" offset="32" context="_385" access="public" location="f2:519" file="f2" line="519"/>
  <Field id="_406" name="w2" type="_134" offset="48" context="_385" access="public" location="f2:520" file="f2" line="520"/>
  <FundamentalType id="_365" name="char" size="8" align="8"/>
  <CvQualifiedType id="_365c" type="_365" const="1"/>
  <CvQualifiedType id="_299c" type="_299" const="1"/>
  <CvQualifiedType id="_164c" type="_164" const="1"/>
  <CvQualifiedType id="_6c" type="_6" const="1"/>
  <CvQualifiedType id="_25c" type="_25" const="1"/>
  <CvQualifiedType id="_128c" type="_128" const="1"/>
  <CvQualifiedType id="_83c" type="_83" const="1"/>
  <CvQualifiedType id="_184c" type="_184" const="1"/>
  <CvQualifiedType id="_189c" type="_189" const="1"/>
  <CvQualifiedType id="_77c" type="_77" const="1"/>
  <CvQualifiedType id="_88c" type="_88" const="1"/>
  <CvQualifiedType id="_124c" type="_124" const="1"/>
  <File id="f0" name="/usr/share/gccxml-0.9/GCC/4.6/gccxml_builtins.h"/>
  <File id="f1" name="/usr/include/x86_64-linux-gnu/bits/time.h"/>
  <File id="f2" name="/usr/local/include/soem/ethercattype.h"/>
  <File id="f3" name="/usr/local/include/soem/ethercatconfig.h"/>
  <File id="f4" name="/usr/include/x86_64-linux-gnu/bits/types.h"/>
  <File id="f5" name="/usr/include/x86_64-linux-gnu/bits/sigset.h"/>
  <File id="f6" name="/usr/include/x86_64-linux-gnu/sys/select.h"/>
  <File id="f7" name="/usr/include/x86_64-linux-gnu/sys/time.h"/>
  <File id="f8" name="/usr/include/time.h"/>
  <CPP_DUMP name="functions"><![CDATA[]]></CPP_DUMP>
  <CPP_DUMP name="aliases"><![CDATA[]]></CPP_DUMP>
  <CPP_DUMP name="excluded"><![CDATA[]]></CPP_DUMP>
</GCC_XML>
